'''
Нули в конец
В школе прошел экзамен по математике.
Несколько человек списали решения
и были замечены. Этим школьникам
поставил 0 баллов.
Задача: есть массив с оценками, среди
которых есть 0. Необходимо все оценки,
равные нулю перенести в конец массива,
чтобы все такие школьники оказались
в конце списка. 
'''
def null_end(arr):
  i, j = 0, 0
  while i < len(arr):
    while i < len(arr) and arr[i]!=0:
      i+=1
    j = i+1
    while j<len(arr) and arr[j]==0 :
      j+=1
    if j<len(arr):
      arr[i], arr[j] = arr[j], arr[i]
      i+=1
    else:
      break
    
  return arr


  

  
