'''
Слияние двух
отсортированных массивов.
Без дополнительных
аллокаций
➔ Дано два отсортированных массива.
Необходимо написать функцию которая
объединит эти два массива в один
отсортированный.
➔ Первый массив имеет размер, равный
результирующиму массиву, значения
в конце равны нулям. Мы не должны
создавать третий массив.
'''
def merge2(a,b):
  j = len(b) - 1
  end = len(a) - 1
  i = end - j - 1
  while j>=0 :
    if i>=0 and a[i]> b[j]:
      a[end] = a[i]
      i-=1
    else:
      a[end] = b[j]
      j-=1
    end-=1
  return a

